Repository: TopScrech/Swifty-Master
Catalog: iOS/Localizable.xcstrings
Source language: en
Languages: de, fr, hi, nl, ru, tr, uk

source: @Environment(\.horizontalSizeClass) lets you detect the available horizontal space class so you can adapt your layout for compact or regular widths
de: Mit @Environment(\.horizontalSizeClass) kannst du die verfügbare horizontale Größenklasse erkennen und dein Layout für kompakte oder reguläre Breiten anpassen
fr: @Environment(\.horizontalSizeClass) permet de détecter la classe de taille horizontale disponible afin d’adapter votre mise en page aux largeurs compactes ou régulières
hi: @Environment(\.horizontalSizeClass) उपलब्ध क्षैतिज आकार वर्ग का पता लगाने देता है, ताकि आप compact या regular चौड़ाइयों के लिए अपना layout अनुकूलित कर सकें
nl: Met @Environment(\.horizontalSizeClass) kun je de beschikbare horizontale size class detecteren, zodat je je layout kunt aanpassen voor compacte of reguliere breedtes
ru: С помощью @Environment(\.horizontalSizeClass) можно определить доступный горизонтальный size class и адаптировать интерфейс под компактную или обычную ширину
tr: @Environment(\.horizontalSizeClass), kullanılabilir yatay size class değerini algılamanızı sağlar; böylece layout’unuzu compact veya regular genişliklere uyarlayabilirsiniz
uk: @Environment(\.horizontalSizeClass) дає змогу визначати доступний горизонтальний клас розміру, щоб адаптувати layout для compact або regular ширини

source: **Bold**, ***bold italic***
de: **Fett**, ***fett kursiv***
fr: **Gras**, ***gras italique***
hi: **बोल्ड**, ***बोल्ड इटैलिक***
nl: **Vet**, ***vet cursief***
ru: **Жирный**, ***жирный курсив***
tr: **Kalın**, ***kalın italik***
uk: **Жирний**, ***жирний курсив***

source: ~~Strikethrough~~
de: ~~Durchgestrichen~~
fr: ~~Barré~~
hi: ~~स्ट्राइकथ्रू~~
nl: ~~Doorgehaald~~
ru: ~~Зачеркнутый~~
tr: ~~Üstü çizili~~
uk: ~~Закреслений~~

source: A confirmation dialog presents a list of choices, typically for destructive or secondary actions
de: Ein Bestätigungsdialog zeigt eine Liste von Optionen, meist für destruktive oder sekundäre Aktionen
fr: Une boîte de dialogue de confirmation présente une liste de choix, généralement pour des actions destructives ou secondaires
hi: Confirmation dialog विकल्पों की सूची दिखाता है, आमतौर पर destructive या secondary actions के लिए
nl: Een bevestigingsdialoog toont een lijst met keuzes, meestal voor destructieve of secundaire acties
ru: Диалог подтверждения показывает список вариантов, обычно для разрушительных или второстепенных действий
tr: Confirmation dialog, genellikle destructive veya secondary actions için bir seçenek listesi sunar
uk: Діалог підтвердження показує список варіантів, зазвичай для руйнівних або другорядних дій

source: A container that enables navigation between views using a navigation bar (deprecated in iOS 16 in favor of NavigationStack)
de: Ein Container, der die Navigation zwischen Ansichten über eine Navigationsleiste ermöglicht (seit iOS 16 zugunsten von NavigationStack veraltet)
fr: Un conteneur qui permet de naviguer entre les vues à l’aide d’une barre de navigation (obsolète depuis iOS 16 au profit de NavigationStack)
hi: एक container जो navigation bar का उपयोग करके views के बीच navigation सक्षम करता है (iOS 16 में NavigationStack के पक्ष में deprecated)
nl: Een container die navigatie tussen weergaven mogelijk maakt met een navigatiebalk (verouderd in iOS 16 ten gunste van NavigationStack)
ru: Контейнер, который обеспечивает навигацию между представлениями с помощью панели навигации (устарел в iOS 16 в пользу NavigationStack)
tr: Navigation bar kullanarak view’lar arasında navigation sağlayan bir container (iOS 16’da NavigationStack lehine deprecated oldu)
uk: Контейнер, що забезпечує навігацію між view за допомогою навігаційної панелі (застарів в iOS 16 на користь NavigationStack)

source: A Link opens a specified URL in the user’s default browser or associated app
de: Ein Link öffnet eine angegebene URL im Standardbrowser des Benutzers oder in der zugehörigen App
fr: Un Link ouvre une URL indiquée dans le navigateur par défaut de l’utilisateur ou dans l’app associée
hi: Link किसी दिए गए URL को user के default browser या संबंधित app में खोलता है
nl: Een Link opent een opgegeven URL in de standaardbrowser van de gebruiker of in de bijbehorende app
ru: Link открывает указанный URL в браузере пользователя по умолчанию или в связанном приложении
tr: Link, belirtilen URL’yi kullanıcının default browser’ında veya ilişkili app içinde açar
uk: Link відкриває вказану URL-адресу в браузері користувача за замовчуванням або у пов’язаній app

source: A modern container for managing a stack of views with programmatic navigation
de: Ein moderner Container zum Verwalten eines Ansichtenstapels mit programmatischer Navigation
fr: Un conteneur moderne pour gérer une pile de vues avec une navigation programmatique
hi: Programmatic navigation के साथ views के stack को manage करने वाला modern container
nl: Een moderne container voor het beheren van een stapel weergaven met programmatische navigatie
ru: Современный контейнер для управления стеком представлений с программной навигацией
tr: Programmatic navigation ile view stack yönetmek için modern bir container
uk: Сучасний контейнер для керування стеком view з програмною навігацією

source: A popover displays a small, dismissible view anchored to another view, commonly used for contextual information or actions
de: Ein Popover zeigt eine kleine ausblendbare Ansicht, die an einer anderen Ansicht verankert ist und häufig für kontextbezogene Informationen oder Aktionen verwendet wird
fr: Un popover affiche une petite vue pouvant être fermée, ancrée à une autre vue, souvent utilisée pour des informations ou actions contextuelles
hi: Popover किसी दूसरी view से जुड़ी छोटी dismissible view दिखाता है, जिसका उपयोग आमतौर पर contextual जानकारी या actions के लिए होता है
nl: Een popover toont een kleine, te sluiten weergave die aan een andere weergave is verankerd en vaak wordt gebruikt voor contextuele informatie of acties
ru: Popover показывает небольшое закрываемое представление, привязанное к другому элементу, и часто используется для контекстной информации или действий
tr: Popover, başka bir view’a bağlı küçük ve kapatılabilir bir view gösterir; genellikle contextual bilgi veya actions için kullanılır
uk: Popover показує невелику dismissible view, прив’язану до іншої view, яку часто використовують для контекстної інформації або дій

source: A ShareLink lets people share a URL, text, or other transferable items using the system share sheet
de: Mit ShareLink können Benutzer eine URL, Text oder andere übertragbare Elemente über das systemeigene Teilen-Menü teilen
fr: Un ShareLink permet de partager une URL, du texte ou d’autres éléments transférables avec la feuille de partage du système
hi: ShareLink लोगों को system share sheet का उपयोग करके URL, text या अन्य transferable items share करने देता है
nl: Met ShareLink kunnen mensen een URL, tekst of andere overdraagbare items delen via het systeemdeelvenster
ru: ShareLink позволяет людям делиться URL, текстом и другими передаваемыми элементами через системное меню шаринга
tr: ShareLink, kullanıcıların sistem share sheet ile URL, text veya diğer transferable items paylaşmasını sağlar
uk: ShareLink дає змогу ділитися URL, текстом або іншими transferable items через системний sheet поширення

source: A sheet presents a modal view over the current screen, often used for settings or secondary content
de: Ein Sheet zeigt eine modale Ansicht über dem aktuellen Bildschirm, häufig für Einstellungen oder sekundäre Inhalte
fr: Une sheet présente une vue modale par-dessus l’écran actuel, souvent utilisée pour des réglages ou du contenu secondaire
hi: Sheet current screen के ऊपर modal view दिखाती है, जिसका उपयोग अक्सर settings या secondary content के लिए होता है
nl: Een sheet presenteert een modale view boven de huidige inhoud en wordt vaak gebruikt voor instellingen of secundaire inhoud
ru: Sheet показывает модальное представление поверх текущего экрана и часто используется для настроек или второстепенного содержимого
tr: Sheet, current screen üzerinde modal view gösterir; genellikle settings veya secondary content için kullanılır
uk: Sheet показує modal view поверх поточного екрана, часто для налаштувань або другорядного вмісту

source: Add all to favorites
de: Alle zu Favoriten hinzufügen
fr: Tout ajouter aux favoris
hi: सभी को favorites में जोड़ें
nl: Voeg alles toe aan favorieten
ru: Добавить всё в избранное
tr: Tümünü favorilere ekle
uk: Додати все до обраного

source: All code blocks
de: Alle Codeblöcke
fr: Tous les blocs de code
hi: सभी code blocks
nl: Alle codeblokken
ru: Все блоки кода
tr: Tüm code blocks
uk: Усі блоки коду

source: Alternate icons are available on iOS only
de: Alternative Icons sind nur auf iOS verfügbar
fr: Les icônes alternatives sont disponibles uniquement sur iOS
hi: Alternate icons केवल iOS पर उपलब्ध हैं
nl: Alternatieve iconen zijn alleen beschikbaar op iOS
ru: Альтернативные иконки доступны только на iOS
tr: Alternate icons yalnızca iOS’te kullanılabilir
uk: Альтернативні іконки доступні лише на iOS

source: Alternate icons are not supported on this device
de: Alternative Icons werden auf diesem Gerät nicht unterstützt
fr: Les icônes alternatives ne sont pas prises en charge sur cet appareil
hi: इस device पर alternate icons supported नहीं हैं
nl: Alternatieve iconen worden op dit apparaat niet ondersteund
ru: Альтернативные иконки не поддерживаются на этом устройстве
tr: Bu device alternate icons desteklemiyor
uk: Альтернативні іконки не підтримуються на цьому пристрої

source: API Key
de: API-Schlüssel
fr: Clé API
nl: API-sleutel
ru: API-ключ
uk: API-ключ

source: Appearance
de: Darstellung
fr: Apparence
nl: Weergave
ru: Оформление
tr: Görünüm
uk: Вигляд

source: Arrange views in a lazy grid, loading items only as they appear on screen for better performance
de: Ordne Ansichten in einem Lazy Grid an, bei dem Elemente für bessere Leistung erst geladen werden, wenn sie auf dem Bildschirm erscheinen
fr: Organise les vues dans une grille lazy, en chargeant les éléments uniquement lorsqu’ils apparaissent à l’écran pour de meilleures performances
hi: बेहतर performance के लिए views को lazy grid में arrange करें, जहां items screen पर दिखाई देने पर ही load होते हैं
nl: Orden weergaven in een lazy grid, waarbij items pas worden geladen wanneer ze in beeld komen voor betere prestaties
ru: Размещайте представления в lazy grid, загружая элементы только по мере их появления на экране для лучшей производительности
tr: Daha iyi performance için items yalnızca ekranda göründükçe yüklenirken view’ları lazy grid içinde düzenler
uk: Розташовує view у lazy grid, завантажуючи елементи лише тоді, коли вони з’являються на екрані, для кращої продуктивності

source: Arranges views horizontally in a single column
de: Ordnet Ansichten horizontal in einer einzelnen Spalte an
fr: Organise les vues horizontalement dans une seule colonne
hi: Views को एक column में horizontally arrange करता है
nl: Rangschikt weergaven horizontaal in één kolom
ru: Располагает представления горизонтально в один столбец
tr: View’ları tek bir column içinde yatay olarak düzenler
uk: Розташовує view горизонтально в одному стовпці

source: Arranges views horizontally in a single row
de: Ordnet Ansichten horizontal in einer einzelnen Zeile an
fr: Organise les vues horizontalement sur une seule ligne
hi: Views को एक row में horizontally arrange करता है
nl: Rangschikt weergaven horizontaal in één rij
ru: Располагает представления горизонтально в один ряд
tr: View’ları tek bir row içinde yatay olarak düzenler
uk: Розташовує view горизонтально в одному рядку

source: Arranges views vertically in a single column
de: Ordnet Ansichten vertikal in einer einzelnen Spalte an
fr: Organise les vues verticalement dans une seule colonne
hi: Views को एक column में vertically arrange करता है
nl: Rangschikt weergaven verticaal in één kolom
ru: Располагает представления вертикально в один столбец
tr: View’ları tek bir column içinde dikey olarak düzenler
uk: Розташовує view вертикально в одному стовпці

source: Arranges views vertically in a single row
de: Ordnet Ansichten vertikal in einer einzelnen Zeile an
fr: Organise les vues verticalement sur une seule ligne
hi: Views को एक row में vertically arrange करता है
nl: Rangschikt weergaven verticaal in één rij
ru: Располагает представления вертикально в один ряд
tr: View’ları tek bir row içinde dikey olarak düzenler
uk: Розташовує view вертикально в одному рядку

source: Badge over app icon
de: Badge über dem App-Icon
fr: Badge sur l’icône de l’app
hi: App icon पर badge
nl: Badge over app-icoon
ru: Значок над иконкой приложения
tr: App icon üzerinde badge
uk: Badge над іконкою app

source: Bundle.main.preferredLocalizations returns the app’s preferred language codes, which you can use to adjust content or behavior based on the user’s locale
de: Bundle.main.preferredLocalizations gibt die bevorzugten Sprachcodes der App zurück, mit denen du Inhalte oder Verhalten an die Locale des Benutzers anpassen kannst
fr: Bundle.main.preferredLocalizations renvoie les codes de langue préférés de l’app, que vous pouvez utiliser pour ajuster le contenu ou le comportement selon la locale de l’utilisateur
hi: Bundle.main.preferredLocalizations app के preferred language codes लौटाता है, जिनसे आप user की locale के आधार पर content या behavior adjust कर सकते हैं
nl: Bundle.main.preferredLocalizations retourneert de voorkeurstaalcodes van de app, die je kunt gebruiken om inhoud of gedrag op basis van de locale van de gebruiker aan te passen
ru: Bundle.main.preferredLocalizations возвращает коды предпочтительных языков приложения, которые можно использовать для адаптации содержимого или поведения под локаль пользователя
tr: Bundle.main.preferredLocalizations app’in tercih ettiği language codes değerlerini döndürür; bunları kullanıcının locale değerine göre content veya behavior ayarlamak için kullanabilirsiniz
uk: Bundle.main.preferredLocalizations повертає бажані мовні коди app, які можна використати для налаштування вмісту або поведінки відповідно до locale користувача

source: but first, choose the interface that's comfortable for you
de: Wähle zuerst die Oberfläche, die für dich angenehm ist
fr: mais d’abord, choisissez l’interface qui vous convient
hi: लेकिन पहले, वह interface चुनें जो आपके लिए comfortable हो
nl: maar kies eerst de interface die voor jou prettig is
ru: но сначала выберите интерфейс, который вам удобен
tr: ama önce sizin için rahat olan interface’i seçin
uk: але спочатку виберіть інтерфейс, який вам зручний

source: Button is a UI element that allows users to trigger an action when tapped
de: Button ist ein UI-Element, mit dem Benutzer durch Tippen eine Aktion auslösen können
fr: Button est un élément d’interface qui permet aux utilisateurs de déclencher une action lorsqu’ils le touchent
hi: Button एक UI element है जिससे users tap करने पर action trigger कर सकते हैं
nl: Button is een UI-element waarmee gebruikers een actie kunnen uitvoeren wanneer erop wordt getikt
ru: Button — это элемент интерфейса, который позволяет пользователям запускать действие при нажатии
tr: Button, users’ın dokunduğunda bir action tetiklemesini sağlayan UI element’tir
uk: Button — це UI element, який дає користувачам змогу запускати дію після натискання

source: Cancel
de: Abbrechen
fr: Annuler
nl: Annuleren
ru: Отмена
tr: Vazgeç
uk: Скасувати

source: Cat
de: Katze
fr: Chat
hi: बिल्ली
nl: Kat
ru: Кошка
tr: Kedi
uk: Кіт

source: Categories
de: Kategorien
fr: Catégories
nl: Categorieën
ru: Категории
tr: Kategoriler
uk: Категорії

source: Change badge number to %lld
de: Badge-Zahl auf %lld ändern
fr: Changer le numéro du badge en %lld
hi: Badge number को %lld में बदलें
nl: Wijzig badgenummer naar %lld
ru: Изменить число на значке на %lld
tr: Badge sayısını %lld olarak değiştir
uk: Змінити число badge на %lld

source: Change language
de: Sprache ändern
fr: Changer de langue
hi: भाषा बदलें
nl: Taal wijzigen
ru: Сменить язык
tr: Dili değiştir
uk: Змінити мову

source: Check the app icon on the home screen
de: Prüfe das App-Icon auf dem Home-Bildschirm
fr: Vérifiez l’icône de l’app sur l’écran d’accueil
hi: Home screen पर app icon check करें
nl: Controleer het app-icoon op het beginscherm
ru: Проверьте иконку приложения на домашнем экране
tr: Home screen’de app icon’u kontrol edin
uk: Перевірте іконку app на домашньому екрані

source: Choose a category
de: Kategorie auswählen
fr: Choisir une catégorie
hi: Category चुनें
nl: Kies een categorie
ru: Выберите категорию
tr: Kategori seç
uk: Виберіть категорію

source: Choose a topic
de: Thema auswählen
fr: Choisir un sujet
hi: Topic चुनें
nl: Kies een onderwerp
ru: Выберите тему
tr: Konu seç
uk: Виберіть тему

source: Choose an action
de: Aktion auswählen
fr: Choisir une action
hi: Action चुनें
nl: Kies een actie
ru: Выберите действие
tr: Action seç
uk: Виберіть дію

source: Choose your navigation experience
de: Wähle dein Navigationserlebnis
fr: Choisissez votre expérience de navigation
hi: अपना navigation experience चुनें
nl: Kies je navigatie-ervaring
ru: Выберите удобный способ навигации
tr: Navigation deneyiminizi seçin
uk: Виберіть свій спосіб навігації

source: Code line numbers
de: Code-Zeilennummern
fr: Numéros de ligne du code
nl: Codelijnnummers
ru: Номера строк кода
uk: Номери рядків коду

source: Collections
de: Sammlungen
nl: Collecties
ru: Коллекции
tr: Koleksiyonlar
uk: Колекції

source: Color
de: Farbe
fr: Couleur
nl: Kleur
ru: Цвет
tr: Renk
uk: Колір

source: Coming soon...
de: Demnächst...
fr: Bientôt disponible...
hi: जल्द आ रहा है...
nl: Binnenkort beschikbaar...
ru: Скоро...
tr: Yakında...
uk: Незабаром...

source: Conditional compilation checks let you run different code depending on the platform or environment your app is built for
de: Mit Prüfungen für bedingte Kompilierung kannst du je nach Plattform oder Umgebung, für die deine App gebaut wird, unterschiedlichen Code ausführen
fr: Les vérifications de compilation conditionnelle permettent d’exécuter un code différent selon la plateforme ou l’environnement pour lequel votre app est construite
hi: Conditional compilation checks आपको platform या environment के अनुसार अलग code चलाने देते हैं जिसके लिए आपका app build किया गया है
nl: Controles voor conditionele compilatie laten je verschillende code uitvoeren afhankelijk van het platform of de omgeving waarin je app wordt gebouwd
ru: Проверки условной компиляции позволяют выполнять разный код в зависимости от платформы или окружения сборки приложения
tr: Conditional compilation checks, app’inizin build edildiği platform veya environment’a göre farklı code çalıştırmanızı sağlar
uk: Перевірки умовної компіляції дають змогу запускати різний код залежно від платформи або середовища, для якого збирається app

source: Content
de: Inhalt
fr: Contenu
nl: Inhoud
ru: Содержимое
tr: İçerik
uk: Вміст

source: Context Menu allows displaying a menu of actions when a user holds a specific element where .contextMenu was applied
de: Context Menu zeigt ein Aktionsmenü an, wenn ein Benutzer ein bestimmtes Element gedrückt hält, auf das .contextMenu angewendet wurde
fr: Context Menu permet d’afficher un menu d’actions lorsqu’un utilisateur maintient un élément spécifique auquel .contextMenu a été appliqué
hi: Context Menu actions का menu दिखाने देता है जब user किसी ऐसे element को hold करता है जिस पर .contextMenu लगाया गया है
nl: Context Menu toont een menu met acties wanneer een gebruiker een element ingedrukt houdt waarop .contextMenu is toegepast
ru: Context Menu показывает меню действий, когда пользователь удерживает элемент, к которому применен .contextMenu
tr: Context Menu, user .contextMenu uygulanmış belirli bir element’i basılı tuttuğunda actions menüsü göstermeyi sağlar
uk: Context Menu дає змогу показати меню дій, коли користувач утримує певний елемент, до якого застосовано .contextMenu

source: Control
de: Steuerung
fr: Contrôle
nl: Bediening
ru: Управление
tr: Kontrol
uk: Керування

source: Control button that navigates to a destination view when tapped
de: Steuerelement-Button, der beim Tippen zu einer Zielansicht navigiert
fr: Bouton de contrôle qui navigue vers une vue de destination lorsqu’il est touché
hi: Control button जो tap करने पर destination view पर navigate करता है
nl: Bedieningsknop die naar een doelview navigeert wanneer erop wordt getikt
ru: Кнопка управления, которая при нажатии переходит к целевому представлению
tr: Dokunulduğunda destination view’a navigate eden control button
uk: Control button, який після натискання переходить до destination view

source: Copy
de: Kopieren
fr: Copier
nl: Kopiëren
ru: Копировать
tr: Kopyala
uk: Копіювати

source: Custom Label
de: Eigenes Label
fr: Libellé personnalisé
nl: Aangepast label
ru: Пользовательская метка
tr: Özel Label
uk: Власний Label

source: Dark
de: Dunkel
fr: Sombre
nl: Donker
ru: Темное
tr: Koyu
uk: Темний

source: Delete
de: Löschen
fr: Supprimer
nl: Verwijderen
ru: Удалить
tr: Sil
uk: Видалити

source: Destructive buttton
de: Destruktiver Button
fr: Bouton destructif
hi: Destructive button
nl: Destructieve knop
ru: Разрушающая кнопка
tr: Destructive button
uk: Руйнівна кнопка

source: Detecting Low Power Mode helps conserve energy and maintain a smooth user experience when the battery is low. SwiftUI apps can adjust behavior by disabling power-intensive features to align with system energy-saving goals
de: Das Erkennen des Stromsparmodus hilft, Energie zu sparen und bei niedrigem Akkustand eine flüssige Benutzererfahrung zu erhalten. SwiftUI-Apps können ihr Verhalten anpassen, indem sie energieintensive Funktionen deaktivieren, um die Energiesparziele des Systems zu unterstützen
fr: Détecter le mode économie d’énergie aide à préserver la batterie et à maintenir une expérience fluide lorsque le niveau de batterie est faible. Les apps SwiftUI peuvent adapter leur comportement en désactivant les fonctionnalités gourmandes en énergie pour s’aligner sur les objectifs d’économie du système
hi: Low Power Mode detect करने से energy बचाने और battery low होने पर smooth user experience बनाए रखने में मदद मिलती है. SwiftUI apps energy-intensive features disable करके system energy-saving goals के अनुसार behavior adjust कर सकते हैं
nl: Het detecteren van de energiebesparingsmodus helpt energie te besparen en een soepele gebruikerservaring te behouden wanneer de batterij bijna leeg is. SwiftUI-apps kunnen hun gedrag aanpassen door energie-intensieve functies uit te schakelen
ru: Определение режима энергосбережения помогает экономить энергию и сохранять плавную работу приложения при низком заряде батареи. Приложения SwiftUI могут адаптировать поведение, отключая энергозатратные функции
tr: Low Power Mode algılamak enerji tasarrufu sağlar ve battery düşükken akıcı user experience korumaya yardımcı olur. SwiftUI apps, enerji yoğun features’ı devre dışı bırakarak behavior’ını sistemin energy-saving goals değerlerine göre ayarlayabilir
uk: Виявлення Low Power Mode допомагає економити енергію та підтримувати плавний досвід користування, коли заряд батареї низький. SwiftUI apps можуть змінювати поведінку, вимикаючи енергоємні функції відповідно до системних цілей енергозбереження
